app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("name", "description", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Pantalon"], ["description", "azul corte recto"], ["quantity", 2], ["created_at", "2024-06-05 03:06:14.247083"], ["updated_at", "2024-06-05 03:06:14.247083"]]

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "Corte Recto"], ["updated_at", "2024-06-05 03:46:01.082342"], ["id", 5]]